<?php

namespace App\Constants;

class CsvConstants
{
    const GENDER_NONE = 0;
    const GENDER_MAN = 1;
    const GENDER_WOMAN = 2;
    const CSV_COLUMS_NAME_FOR_INPORT_TO_FINANCE_APP = [
                '月種別',
                '種類',
                '形式',
                '作成方法',
                '付箋',
                '伝票日付',
                '伝票番号',
                '伝票摘要',
                '枝番',
                '借方部門',
                '借方部門名',
                '借方科目',
                '借方科目名',
                '借方補助',
                '借方補助科目名',
                '借方金額',
                '借方消費税コード',
                '借方消費税業種',
                '借方消費税税率',
                '借方資金区分',
                '借方任意項目１',
                '借方任意項目２',
                '貸方部門',
                '貸方部門名',
                '貸方科目',
                '貸方科目名',
                '貸方補助',
                '貸方補助科目名',
                '貸方金額',
                '貸方消費税コード',
                '貸方消費税業種',
                '貸方消費税税率',
                '貸方資金区分',
                '貸方任意項目１',
                '貸方任意項目２',
                '摘要',
                '期日',
                '証番号',
                '入力マシン',
                '入力ユーザ',
                '入力アプリ',
                '入力会社',
                '入力日付',
            ];

}